app/views/comments/new.html.erb

    <%= f.label :user_id %><br />
    <%= f.collection_select :user_id, User.all, :id, :name %>
---
SELECT "users".* FROM "users"