app/views/users/_form.html.erb

  <p>
  <% for group in Group.all %>
    <%= check_box_tag "user[group_ids][]", group.id, @user.groups.include?(group) %>
---
SELECT "groups".* FROM "groups"
SELECT  1 AS one FROM "groups" INNER JOIN "memberships" ON "groups"."id" = "memberships"."group_id" WHERE "memberships"."user_id" = $1 AND "groups"."id" = 3 LIMIT 1  [["user_id", 22]]