app/views/users/index.html.erb


  <%= pluralize user.comments.count, "comment" %><br />
---
SELECT COUNT(*) FROM "comments"  WHERE "comments"."user_id" = $1  [["user_id", 2]]