app/views/users/show.html.erb

SELECT "groups".* FROM "groups" INNER JOIN "memberships" ON "groups"."id" = "memberships"."group_id" WHERE "memberships"."user_id" = $1  [["user_id", 16]]
---
<strong>Groups</strong>
  <% @user.groups.each do |group|%>