app/controllers/comments_controller.rb

  def index
    # this will find out all the comment where "admin" column column value in the users table is true.
    @comments = Comment.joins(:user).where("users.admin"=> true).order("comments.created_at asc")
---
SELECT "comments".* FROM "comments" INNER JOIN "users" ON "users"."id" = "comments"."user_id" WHERE "users"."admin" = 't'  ORDER BY comments.created_at asc

  def show
    @comment = Comment.find(params[:id])
---
SELECT  "comments".* FROM "comments"  WHERE "comments"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @comment = Comment.new(comment_params)
    if @comment.save
---
INSERT INTO "comments" ("content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "admin1 comments 1"], ["created_at", "2014-08-12 08:07:57.611040"], ["updated_at", "2014-08-12 08:07:57.611040"], ["user_id", 2]]

  def edit
    @comment = Comment.find(params[:id])
---
SELECT  "comments".* FROM "comments"  WHERE "comments"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    @comment = Comment.find(params[:id])
    if @comment.update_attributes(comment_params)
---
SELECT  "comments".* FROM "comments"  WHERE "comments"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "comments" SET "content" = $1, "updated_at" = $2 WHERE "comments"."id" = 2  [["content", "dfsdfgsfgxcvxvbb"], ["updated_at", "2014-08-12 07:20:53.843211"]]