app/controllers/groups_controller.rb

  def index
    @groups = Group.all
---
SELECT "groups".* FROM "groups"

  def show
    @group = Group.find(params[:id])
---
SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @group = Group.new(group_params)
    if @group.save
---
INSERT INTO "groups" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-08-12 07:52:03.411428"], ["name", "hackers"], ["updated_at", "2014-08-12 07:52:03.411428"]]

  def edit
    @group = Group.find(params[:id])
---
SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    @group = Group.find(params[:id])
    if @group.update_attributes(group_params)
---
SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "groups" SET "name" = $1, "updated_at" = $2 WHERE "groups"."id" = 1  [["name", "hackers dsfd"], ["updated_at", "2014-08-12 07:56:45.742144"]]

  def destroy
    @group = Group.find(params[:id])
    @group.destroy
---
SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "groups" WHERE "groups"."id" = $1  [["id", 1]]