app/controllers/users_controller.rb

SELECT "users".* FROM "users" INNER JOIN "memberships" ON "memberships"."user_id" = "users"."id" INNER JOIN "groups" ON "groups"."id" = "memberships"."group_id" INNER JOIN "memberships" "memberships_users" ON "memberships_users"."user_id" = "users"."id"
INSERT INTO "memberships" ("created_at", "group_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-08-13 10:29:37.822179"], ["group_id", 3], ["updated_at", "2014-08-13 10:29:37.822179"], ["user_id", 40]]
INSERT INTO "users" ("admin", "created_at", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["admin", "t"], ["created_at", "2014-08-12 06:59:03.284416"], ["name", "sdfsdf"], ["updated_at", "2014-08-12 06:59:03.284416"]]
---
  def create
    @user = User.joins(:memberships).new(user_params)
    if @user.save

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "users" SET "admin" = $1, "name" = $2, "updated_at" = $3 WHERE "users"."id" = 1  [["admin", "f"], ["name", "mohit"], ["updated_at", "2014-08-12 07:03:47.331847"]]
---
  def update
    @user = User.find(params[:id])
    @user.update_attributes(user_params)